app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (users.name LIKE '%%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (users.name LIKE '%%')
---
  def index
    # @users = User.all
    # 使用分页
    @users = User.paginate(page: params[:page])